[
  {
    "indexPage": {
      "nameCard": {
        "portrait": { "src": "portrait.png", "alt": "Kutay Furtun portrait" },
        "name": "Kutay Furtun",
        "title": "Software Developer",
        "buttons": [
          { "text": "resume", "path": "/resume", "isPrimary": true },
          { "text": "projects", "path": "/projects", "isPrimary": false }
        ]
      },
      "introduction": {
        "header": "Hello",
        "intro": "I'm Kutay and I work at Critical Mass as a Software Developer",
        "description": "I'm a software developer specializing in the MERN tech stack. I have a solid foundation in JavaScript and TypeScript, along with a deep understanding of GraphQL, data structures, and algorithms.\n\nI thrive on building scalable web applications. My portfolio exhibits a diverse range of projects that highlight my ability to deliver clean code and tackle complex problems. With a passion for continuous learning, I stay updated with the latest industry trends."
      }
    },
    "resumePage": {
      "title": "Resume",
      "experience": "Experience",
      "download": "Download",
      "resumePath": "resume.pdf",
      "education": "Education",
      "experiences": [
        {
          "date": "May 2022-Present",
          "position": "Junior Developer",
          "company": "Critical Mass",
          "location": "Calgary, AB (Remote)",
          "description": "As software developer, I play a vital role in maintaining and building the website of a market-leading car manufacturer's shopping tools. Using JavaScript, React, Styled Components, and GraphQL, I contribute to enhancing the website's performance and user experience.\n\nMy focus is on delivering impactful digital solutions and staying up-to-date with the latest industry practices. I am dedicated to making a positive impact on the company's online presence."
        },
        {
          "date": "Feb 19-Jul 21",
          "position": "•Area Manager\n•Inventory Supervisor\n•Inventory Associate",
          "company": "WIS International",
          "location": "Vancouver, BC",
          "description": "I played a crucial role in leading inventory audits and managing teams while handling internal software for inventory audits. Additionally, I provided training and support to new team members, ensuring smooth operations and effective communication.\n\nThese experiences have equipped me with strong problem-solving, data management, and communication skills that I now bring to my software development career."
        }
      ],
      "educations": [
        {
          "date": "Oct 21-May 22",
          "degree": "Full Stack Web Development Diploma",
          "school": "Concordia University",
          "location": "Montreal, QB (Online)",
          "description": "Throughout the program, I gained proficiency in JavaScript, CSS, and HTML, which form the building blocks of web development. I also learned how to leverage the power of React for creating dynamic and interactive user interfaces.\n\nOn the backend, I acquired skills in Node.js and Express.js, enabling me to build robust server-side applications and RESTful APIs. Additionally, I gained expertise in working with MongoDB, a popular NoSQL database, for efficient data storage and retrieval.\n\nThis program provided me with the knowledge and practical skills to handle both front-end and back-end development, making me a versatile full stack web developer ready to tackle a wide range of projects."
        },
        {
          "date": "Jan 17-May 18",
          "degree": "M.Sc in Supply Chain Management",
          "school": "Fairleigh Dickinson University",
          "location": "Madison, NJ",
          "description": "It provided me with valuable skills applicable to software development. I gained a comprehensive understanding of supply chain processes, optimizing efficiency and problem-solving. This program also emphasized complex network management, aligning with the coordination and integration required in software development teams.\n\nOverall, this program equipped me with transferable skills and a strategic mindset essential for success in software development."
        },
        {
          "date": "Sept 10-Jul 15",
          "degree": "B.Sc in Naval Architecture and Marine Engineering",
          "school": "Yildiz Technical University",
          "location": "Istanbul, Turkiye",
          "description": "I gained extensive knowledge and practical skills in ship design, structural analysis, and marine systems. This program honed my problem-solving abilities and critical thinking skills, which are valuable in software development. Working with complex design software and analyzing data sets prepared me for the technical aspects of software development.\n\nOverall, this program provided a solid engineering foundation and equipped me with the skills necessary to succeed in software development projects."
        }
      ]
    },
    "projectsPage": {
      "title": "Projects",
      "intro": "Here are my side projects besides working full time.",
      "projects": [
        {
          "title": "Personal Website",
          "type": "Individual Project",
          "description": "My personal website serves as an online portfolio showcasing my skills, projects, and achievements. Built with Gatsby(TS) and Styled Components, it offers a seamless and optimized user experience. Leveraging the power of various Gatsby plugins, the website ensures fast loading times, SEO optimization, and markdown support. ",
          "image": {
            "img": "personal-website.png",
            "alt": "Personal Website Screen Shot"
          },
          "link": "https://kutayfurtun.com/",
          "github": "https://github.com/kfurtun/personal-website"
        },
        {
          "title": "Fantasy Soccer League",
          "type": "Individual Project",
          "description": "The personal web development project utilized React(JS), Express.js, and MongoDB. Developed as a final project, it showcased proficiency in full-stack web development with features such as dynamic user interfaces, seamless data flow, and user authentication. Although unpublished, the project served as a valuable learning experience, strengthening skills in modern web technologies. ",
          "image": {
            "img": "",
            "alt": ""
          },
          "link": "",
          "github": "https://github.com/kfurtun/fantasy-soccer-league"
        },
        {
          "title": "Wearables E-commerce Platform",
          "type": "Group Project",
          "description": "The group project was a collaborative endeavor that utilized React(JS), Express.js, and MongoDB technologies. Using Git and GitHub for source control, the team worked together to develop a web application with a robust user interface, seamless data flow, and efficient data storage and retrieval. Despite not being published, the project demonstrated the collective proficiency of the team in these technologies, as well as effective collaboration and version control practices in a group setting. ",
          "image": {
            "img": "wearables.png",
            "alt": "A wacth is displayed with the information of it's name, producer and price"
          },
          "link": "",
          "github": "https://github.com/kfurtun/wearables-ecommerce-platform"
        },
        {
          "title": "Canadian Citizenship Eligibility Calculator",
          "type": "Individual Project",
          "description": "The practice project utilized React Native and its libraries to create a mobile application for calculating Canadian citizenship eligibility dates. While not intended for publication, the project aimed to provide a user-friendly interface for inputting information and determining eligibility. It served as a valuable practice exercise in React Native(JS) development.",
          "image": {
            "img": "citizenship.png",
            "alt": "The summary page of an applicant where information is given about theirs history"
          },
          "link": "",
          "github": "https://github.com/kfurtun/canada-citizenship-calc-app"
        },
        {
          "title": "Budget Planner App",
          "type": "Individual Project",
          "description": "The individual budget app project utilized React(JS), Node.js/Express.js, and MS SQL, among other related libraries. It aimed to create a user-friendly application for efficient budget management. Leveraging React for the front-end and Node.js/Express.js for the back-end, the project showcased proficiency in building a comprehensive budget app for personal finance tracking.",
          "image": {
            "img": "budget-planner.png",
            "alt": "A graph and a table that show the income and expense of a user"
          },
          "link": "",
          "github": "https://github.com/kfurtun/budget-planner"
        }
      ]
    }
  }
]
